---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinTypen1
source: html/86b5dde3-bc13-d6d2-a1c8-6bdd79b79ad0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinTypen1 Property

"Primary Bar - Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinTypen1 { get; }
```